<div id="information_unity_workshops">
    <p>Kursen inneh&aring;ller <strong><span style="background-color: #f1c40f;">5</span> Unity-workshops</strong> som ligger under kursens f&ouml;rsta 3 veckor. Dessa &auml;r <strong>examinerande</strong> och utf&ouml;rs tillsammans med din projektgrupp.</p>
    <ul>
        <li><span style="background-color: #c2e0f4;">L&auml;nk till gruppindelning</span></li>
        <li><span style="background-color: #c2e0f4;">L&auml;nk till workshop-schema</span></li>
    </ul>
    <p>&nbsp;</p>
    <p>Under workshopsen kommer du gradvis bygga upp en liten spelprototyp i Unity.</p>
    <p>&nbsp;</p>
    <h4 id="f&ouml;rberedelser">F&ouml;rberedelse</h4>
    <p><strong>Inf&ouml;r <span style="text-decoration: underline;">varje</span> workshop</strong> f&ouml;rv&auml;ntas du f&ouml;rbereda dig genom att <strong>studera inl&auml;sningsmaterialet</strong> h&auml;r p&aring; Canvas. Du f&ouml;rv&auml;ntas inte kunna allt fr&aring;n inl&auml;sningsmaterialet utantill utan du har m&ouml;jliget att repetera och anv&auml;nda inl&auml;sningsmaterialet som st&ouml;d under workshopen. D&auml;remot blir det sv&aring;rt att hinna utf&ouml;ra workshopen under den tid du f&aring;r om du &auml;r helt ny till allt det du f&ouml;rv&auml;ntas g&ouml;ra.</p>
    <ul>
        <li><span style="background-color: #c2e0f4;">L&auml;nk till inl&auml;sningsmaterial, f&ouml;r varje Workshop</span></li>
    </ul>
    <p><strong>Innan <span style="text-decoration: underline;">f&ouml;rsta</span> workshopen</strong> beh&ouml;ver du se till att du har <strong>anv&auml;ndarkonto</strong> f&ouml;r Unity och GitHub.</p>
    <ul>
        <li><span style="background-color: #c2e0f4;">L&auml;nk till instruktioner f&ouml;r att skapa Unity-anv&auml;ndare (+ student-licens)</span></li>
        <li><span style="background-color: #c2e0f4;">L&auml;nk till instruktioner f&ouml;r att skapa GitHub-konto.</span></li>
    </ul>
    <p>&nbsp;</p>
    <h4>Utf&ouml;rande</h4>
    <p>Under workshopen f&aring;r du <span style="background-color: #f1c40f;">2 timmar</span> tillsammans med din grupp att genomf&ouml;ra ett antal uppgifter i Unity relaterat till det inl&auml;sningsmaterial ni f&aring;tt. Det kan exempelvis handla om att skapa ett material i Unity, implementera en animation eller versionshantera projektet. <span style="background-color: #f1c40f;">Varje medlem i gruppen beh&ouml;ver utf&ouml;ra uppgifterna i ett individuellt projekt</span>, men ni f&aring;r g&auml;rna jobba tillsammans och hj&auml;lpa varandra.</p>
    <p>I slutet av varje workshop presenterar ni resultatet f&ouml;r en l&auml;rare som kommer st&auml;lla fr&aring;gor om hur ni har utf&ouml;rt uppgifterna. Det kan exempelvis handla om fr&aring;gor som "visa hur man &ouml;ppnar animator-f&ouml;nstret i Unity" eller "hur skapar man en NavMesh s&aring; att fiender kan r&ouml;ra sig runt p&aring; banan?"</p>
</div>